                       Adding one row pandas DataFrame

In [1]:
import pandas as pd
mark=({'name':['suraksha','prathvi','sandhya','prathiksha'],
      'maths':[87,98,87,95],
      'itskills':[83,90,84,76]})
df=pd.DataFrame(mark)
display(df)

         name  maths  itskills
0    suraksha     87        83
1     prathvi     98        90
2     sandhya     87        84
3  prathiksha     95        76

In [2]:
df.loc[len(df.index)]=['lavanya',89,90]
df1=df
df1

         name  maths  itskills
0    suraksha     87        83
1     prathvi     98        90
2     sandhya     87        84
3  prathiksha     95        76
4     lavanya     89        90

In [7]:
df.loc[2]=['lavanya',89,90]
df

         name  maths  itskills
0    suraksha     87        83
1     prathvi     98        90
2     lavanya     89        90
3  prathiksha     95        76
4     lavanya     89        90